jahnavinanduri10/microcontrollers_stm32/35_UART_DMABareMetal/Src/007_i2c_slave_tx.c
#include<stdio.h>
#include<string.h>
#include "stm32f407xx.h"

#define SLAVE_ADDR  0x68
void delay(void)
{
	for(uint32_t i = 0 ; i < 500000/2 ; i ++);
}

uint8_t tx_buff[32] = "STM32 Slave mode";
I2C_Handle_t I2C1Handle;

/*
 * PB6 -> SCL
 * PB9 or PB7 -> SDA
 */

void I2C1_GPIOInit(void)
{
	GPIO_Handle_t I2CPins;

	/*Note : Internal pull-up resistors are used */

	I2CPins.pGPIOx = GPIOB;
	I2CPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	I2CPins.GPIO_PinConfig.GPIO_PinOPtype = GPIO_OP_TYPE_OD;
	/*
	 * Note : In the below line use GPIO_NO_PUPD option if you want to use external pullup resistors, then you have to use 3.3K pull up resistors
	 * for both SDA and SCL lines
	 */
	I2CPins.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PIN_PU;
	I2CPins.GPIO_PinConfig.GPIO_PinAltFunMode = 4;
	I2CPins. GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;

	//scl
	I2CPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_6;
	GPIO_Init(&I2CPins);


	//sda
	//Note : since we found a glitch on PB9 , you can also try with PB7
	I2CPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_9;

	GPIO_Init(&I2CPins);
}

void I2C1_Inits(void)
{
	I2C1Handle.pI2Cx = I2C1;
	I2C1Handle.I2C_Config.I2C_AckControl = I2C_ACK_ENABLE;
	I2C1Handle.I2C_Config.I2C_DeviceAddress = SLAVE_ADDR;
	I2C1Handle.I2C_Config.I2C_FMDutyCycle = I2C_FM_DUTY_2;
	I2C1Handle.I2C_Config.I2C_SCLSpeed = I2C_SCL_SPEED_SM;

	I2C_Init(&I2C1Handle);
}

int main()
{
	uint8_t command_code,len;

	// i2c pin init
	I2C1_GPIOInit();

	// i2c peripheral configuration
	I2C1_Inits();

	// i2c IRQ config
	I2C_IRQInterruptConfig(IRQ_NO_I2C1_EV, ENABLE);
	I2C_IRQInterruptConfig(IRQ_NO_I2C1_ER, ENABLE);

	I2C_SlaveEnableDisableCallbackEvents(I2C1,ENABLE);

	// enable i2c peripheral
	I2C_PeripheralControl(I2C1, ENABLE);

	I2C_ManageACKing(I2C1, ENABLE);
	while(1)
	{

	}
}

void I2C1_ER_IRQHandler(void)
{
	I2C_ER_IRQHandling(&I2C1Handle);
}

void I2C1_EV_IRQHandler(void)
{
	I2C_EV_IRQHandling(&I2C1Handle);
}

void I2C_ApplicationEventCallback(I2C_Handle_t *pI2CHandle,uint8_t AppEv)
{
	static uint8_t commandCode = 0;
	static uint8_t cnt = 0;
	if(AppEv == I2C_EV_DATA_REQ)
	{
		// Master wants some data, slave has to send it
		if(commandCode == 0x51)
		{
			// send the length info to master
			I2C_SlaveSendData(pI2CHandle->pI2Cx,strlen((char*)tx_buff));
		}
		else if(commandCode == 0x52)
		{
			//send the data
			I2C_SlaveSendData(pI2CHandle->pI2Cx,tx_buff[cnt++]);
		}
	}
	else if(AppEv == I2C_EV_DATA_RCV)
	{
		// Data is waiting for the slave to read, slave has to read it
		commandCode = I2C_SlaveReceiveData(pI2CHandle->pI2Cx);
	}
	else if(AppEv == I2C_ERROR_AF)
	{
		// This happens when slave is transmitting data
		// Master has sent the NACK, so slave should understand that master
		// doesnot need more data
		commandCode = 0xff;
		cnt = 0;
	}
	else if(AppEv == I2C_EV_STOP)
	{
		// This happens only during slave reception
		// Master has ended the I2C communication with slave
	}

}

